Revit 2027 API
Transform2D.SetToIdentity Method
 Set this TrfUV to the identity transform.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform2D SetToIdentity()
Public Function SetToIdentity As Transform2D
public:
Transform2D^ SetToIdentity()
member SetToIdentity : unit -> Transform2D
Return Value
Transform2D
 Returns a pointer to "this" Transform2D.
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace